perf/scenarios/recovery.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: "localhost"
          port: 8125
          prefix: "artillery-api"

  phases:
    - name: Ramp
      duration: 180
      arrivalRate: 15

scenarios:
  - name: Ramp - exchange
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: "2"
            counterAccountId: "1"
            baseAmount: 1000