perf/scenarios/spikes.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: "localhost"
          port: 8125
          prefix: "artillery-api"

  pool: 75

  phases:
    # Warm-up
    - name: Warm-up (poca carga)
      duration: 30
      arrivalRate: 2
      scenario: "ARS_to_USD"

    # Spike 1: ARS → USD
    - name: Spike ARS→USD
      duration: 10
      arrivalRate: 50
      scenario: "ARS_to_USD"

    # Cooldown
    - name: Cooldown 1
      duration: 15
      arrivalRate: 3
      scenario: "ARS_to_USD"
      
    # Spike 2: ARS → USD
    - name: Final Spike ARS→USD
      duration: 12
      arrivalRate: 80
      scenario: "ARS_to_USD"

scenarios:
  # Primer y segundo spike
  - name: "ARS_to_USD"
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: "2"
            counterAccountId: "1"
            baseAmount: 15000